<template>
  <div class="wrapper">
    <div
      class="side-bar__menu-wrapper menu-wrapper"
      :class="{ 'is-dark': dark }"
      @click="isActive = !isActive"
    >
      <div
        class="menu-wrapper__hamburger-menu hamburger-menu"
        :class="{ 'hamburger-menu--active': isActive }"
      ></div>
    </div>
    <div class="nav-bar" v-bind:class="{ 'nav-bar--active': isActive }">
      <div class="nav-bar__links links">
        <div class="links__pages">
          <a href="#" class="page-link">ПАРКОВКА</a>
          <a href="#" class="page-link">СТРАХОВАНИЕ</a>
          <a href="#" class="page-link">БЕНЗИН</a>
          <a href="#" class="page-link">ОБСЛУЖИВАНИЕ</a>
        </div>
        <div class="links__social-media">
          <a href="#">
            <svg
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                id="telegram"
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M32 16C32 24.8366 24.8366 32 16 32C7.16344 32 0 24.8366 0 16C0 7.16344 7.16344 0 16 0C24.8366 0 32 7.16344 32 16ZM10.7144 14.5343C9.11157 15.2341 7.46472 15.9532 5.95883 16.7826L5.95873 16.7828C5.17241 17.3585 6.21758 17.7657 7.19803 18.1476C7.35391 18.2084 7.50814 18.2685 7.65313 18.3285C7.77377 18.3656 7.89647 18.4047 8.02079 18.4443C9.11124 18.7917 10.3272 19.1791 11.3858 18.5963C13.1248 17.5973 14.766 16.4424 16.4059 15.2883C16.9432 14.9102 17.4803 14.5322 18.0207 14.1598C18.046 14.1436 18.0746 14.1251 18.1058 14.1048C18.5662 13.8064 19.6016 13.1353 19.2186 14.06C18.313 15.0504 17.3429 15.9272 16.3676 16.8087C15.7103 17.4027 15.0506 17.999 14.4066 18.6336C13.8457 19.0894 13.2633 20.0059 13.8914 20.644C15.3379 21.6567 16.8071 22.6449 18.2755 23.6325C18.7533 23.9538 19.231 24.2752 19.7079 24.5972C20.516 25.2425 21.779 24.7206 21.9567 23.7123C22.0357 23.2485 22.115 22.7847 22.1944 22.3208C22.6328 19.7578 23.0713 17.1938 23.4587 14.6223C23.5113 14.219 23.571 13.8156 23.6307 13.4121C23.7755 12.434 23.9204 11.4547 23.9656 10.4714C23.849 9.49009 22.6592 9.70585 21.997 9.9265C18.5935 11.2216 15.224 12.6126 11.8679 14.0282C11.4877 14.1967 11.1023 14.3649 10.7144 14.5343Z"
                fill="white"
              />
            </svg>
          </a>
          <a href="#">
            <svg
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                id="facebook"
                d="M32 16C32 7.1625 24.8375 0 16 0C7.1625 0 0 7.1625 0 16C0 23.9875 5.85 30.6062 13.5 31.8062V20.625H9.4375V16H13.5V12.475C13.5 8.46563 15.8875 6.25 19.5438 6.25C21.2938 6.25 23.125 6.5625 23.125 6.5625V10.5H21.1063C19.1188 10.5 18.5 11.7344 18.5 13V16H22.9375L22.2281 20.625H18.5V31.8062C26.15 30.6062 32 23.9875 32 16Z"
                fill="white"
              />
            </svg>
          </a>
          <a href="#">
            <svg
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                id="instagram"
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M16 0C7.16344 0 0 7.16344 0 16C0 24.8366 7.16344 32 16 32C24.8366 32 32 24.8366 32 16C32 7.16344 24.8366 0 16 0ZM12.4822 7.51824C13.3924 7.47682 13.6833 7.46668 16.0008 7.46668H15.9981C18.3164 7.46668 18.6062 7.47682 19.5164 7.51824C20.4248 7.55984 21.0453 7.70366 21.5893 7.91469C22.1511 8.13247 22.6258 8.42403 23.1004 8.8987C23.5751 9.37301 23.8667 9.84911 24.0853 10.4104C24.2951 10.9529 24.4391 11.573 24.4818 12.4815C24.5227 13.3917 24.5333 13.6826 24.5333 16.0001C24.5333 18.3176 24.5227 18.6078 24.4818 19.518C24.4391 20.4261 24.2951 21.0464 24.0853 21.5891C23.8667 22.1502 23.5751 22.6263 23.1004 23.1006C22.6263 23.5753 22.1509 23.8676 21.5898 24.0855C21.0469 24.2965 20.4261 24.4404 19.5176 24.482C18.6074 24.5234 18.3174 24.5335 15.9997 24.5335C13.6824 24.5335 13.3917 24.5234 12.4815 24.482C11.5732 24.4404 10.9529 24.2965 10.41 24.0855C9.84909 23.8676 9.37299 23.5753 8.89886 23.1006C8.42436 22.6263 8.1328 22.1502 7.91467 21.589C7.70382 21.0464 7.56 20.4263 7.51822 19.5178C7.47697 18.6076 7.46666 18.3176 7.46666 16.0001C7.46666 13.6826 7.47733 13.3915 7.51804 12.4813C7.55893 11.5732 7.70293 10.9529 7.91449 10.4102C8.13316 9.84911 8.42472 9.37301 8.89939 8.8987C9.3737 8.4242 9.8498 8.13265 10.411 7.91469C10.9536 7.70366 11.5737 7.55984 12.4822 7.51824Z"
                fill="white"
              />
              <path
                id="instagram"
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M15.2353 9.00445C15.3839 9.00422 15.5438 9.00429 15.7164 9.00437L16.0008 9.00445C18.2792 9.00445 18.5493 9.01263 19.449 9.05352C20.281 9.09156 20.7326 9.23059 21.0334 9.34739C21.4316 9.50206 21.7155 9.68695 22.014 9.98562C22.3127 10.2843 22.4976 10.5687 22.6526 10.967C22.7694 11.2674 22.9086 11.719 22.9465 12.551C22.9874 13.4505 22.9963 13.7208 22.9963 15.9981C22.9963 18.2755 22.9874 18.5457 22.9465 19.4453C22.9084 20.2773 22.7694 20.7288 22.6526 21.0293C22.4979 21.4275 22.3127 21.7111 22.014 22.0096C21.7154 22.3082 21.4318 22.4931 21.0334 22.6478C20.733 22.7651 20.281 22.9038 19.449 22.9418C18.5495 22.9827 18.2792 22.9916 16.0008 22.9916C13.7222 22.9916 13.4522 22.9827 12.5526 22.9418C11.7206 22.9034 11.269 22.7644 10.9681 22.6476C10.5698 22.4929 10.2854 22.3081 9.98671 22.0094C9.68804 21.7107 9.50315 21.427 9.34812 21.0286C9.23132 20.7281 9.09212 20.2766 9.05426 19.4446C9.01337 18.545 9.00519 18.2748 9.00519 15.996C9.00519 13.7172 9.01337 13.4484 9.05426 12.5488C9.0923 11.7168 9.23132 11.2653 9.34812 10.9645C9.50279 10.5662 9.68804 10.2818 9.98671 9.98313C10.2854 9.68446 10.5698 9.49957 10.9681 9.34455C11.2689 9.22721 11.7206 9.08854 12.5526 9.05032C13.3398 9.01476 13.6449 9.0041 15.2353 9.00232V9.00445ZM20.5559 10.4213C19.9905 10.4213 19.5319 10.8795 19.5319 11.445C19.5319 12.0103 19.9905 12.469 20.5559 12.469C21.1212 12.469 21.5799 12.0103 21.5799 11.445C21.5799 10.8797 21.1212 10.421 20.5559 10.421V10.4213ZM11.6185 16.0001C11.6185 13.58 13.5806 11.6179 16.0006 11.6178C18.4208 11.6178 20.3824 13.58 20.3824 16.0001C20.3824 18.4202 18.4209 20.3815 16.0008 20.3815C13.5807 20.3815 11.6185 18.4202 11.6185 16.0001Z"
                fill="white"
              />
              <path
                id="instagram"
                d="M16.0008 13.1556C17.5716 13.1556 18.8453 14.4291 18.8453 16.0001C18.8453 17.571 17.5716 18.8446 16.0008 18.8446C14.4297 18.8446 13.1563 17.571 13.1563 16.0001C13.1563 14.4291 14.4297 13.1556 16.0008 13.1556Z"
                fill="white"
              />
            </svg>
          </a>
        </div>
        <button class="lang-button">
          Eng
        </button>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Menu",
  data() {
    return {
      isActive: false
    };
  },
  props: {
    dark: {
      type: Boolean,
      default: false
    }
  }
};
</script>

<style scoped lang="scss">
@import "../../../public/css/variables";
@import "../../../public/css/hamburger-menu";

.nav-bar {
  position: fixed;
  top: 0;
  left: 0;
  background-color: #151b1f;
  height: 100vh;
  width: 100vw;
  display: none;
}

.nav-bar--active {
  z-index: 1;
  display: block;
  opacity: 1;
  animation: menu 0.1s;
}

@keyframes menu {
  0% {
    opacity: 0;
  }
  100% {
    opacity: 0.9;
  }
}

.nav-bar__links {
  margin-left: 100px;
  height: 100vh;
  width: 40%;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: flex-start;

  .page-link {
    margin-top: 30px;
  }

  .links__social-media {
    margin-top: 40px;
  }
}

.links__pages {
  display: flex;
  flex-direction: column;
}

.page-link {
  text-decoration: none;
  font-size: 32px;
  color: #fff;

  &:hover {
    color: $main-accent-color;
  }
}

.links__social-media {
  display: flex;
  flex-direction: row;

  a {
    margin-right: 24px;

    svg:hover #facebook,
    svg:hover #telegram,
    svg:hover #instagram {
      fill: $main-accent-color;
    }
  }
}

.lang-button {
  display: none;
  position: absolute;
  bottom: 30px;
  background-color: #151b1f;
  color: $main-accent-color;
  font-size: 13px;
  width: 45px;
  padding: 13px 0 13px 0;
  font-weight: bold;
  cursor: pointer;
  border: 1px solid #151b1f;
  border-radius: 50%;
  outline: none; /*где-то в мире разозлился один Вадим Макеев*/

  &:hover {
    color: #fff;
    border-color: #fff;
    transition: all 0.3s;
  }

  &:active {
    color: $main-accent-color;
  }
}

@media (max-width: 1024px) {
  .page-link {
    font-size: 28px;
  }

  .nav-bar {
    opacity: 1;
  }
}

@media (max-width: 768px) {
  .nav-bar {
    .nav-bar__links {
      margin-left: 25px;
      margin-top: 60px;
    }
  }

  .nav-bar__links {
    justify-content: flex-start;

    .page-link {
      font-size: 22px;
      margin-top: 15px;
    }
  }

  .lang-button {
    display: block;
  }
}
</style>
